'''
Задание 6.
Дано предложение. Напечатать его в обратном порядке слов.
'''

txt = input().split(' ')[::-1]
print(' '.join(txt))